dafoam-tutorials-main/PeriodicHill_FieldInversion/0.orig/UData
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      UData;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
3500
(
(0.001938900362454894 -1.09291138890157e-05 9.975407269440042e-20)
(0.001950374088929808 -0.000272567421734815 6.074807821033633e-19)
(0.0007845923825563899 -0.0003528113527903084 -1.147803735024461e-19)
(-8.166239834977196e-05 3.10534719275024e-05 -5.137378844827662e-19)
(-0.0001901264166758443 0.0001431474977192166 6.679788316479386e-20)
(-0.0001664635339621496 0.0001362858851051716 -9.775703605540931e-20)
(-0.0001796221825539274 0.0001442248586783319 6.100188378677342e-20)
(-0.0001836898000519062 0.0001434362899148566 3.236231605378908e-20)
...
)
;

boundaryField
{
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
    topWall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    bottomWall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    front
    {
        type            symmetry;
    }
    back
    {
        type            symmetry;
    }
}
// ************************************************************************* //