dafoam-tutorials-main/PeriodicHill_FieldInversion/system/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
/*
momentumSource
{
    type            meanVelocityForce;
    active          yes;            //on/off switch

    meanVelocityForceCoeffs
    {
        selectionMode   all;       //cellSet // points //cellZone

        fields      (U);
        Ubar        (0.020188 0 0 );
        relaxation  1.0; 
    }
}
*/

// ************************************************************************* //
